tap "bazelbuild/tap"
tap "buildpacks/tap"
tap "caskformula/caskformula"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "sambadevi/powerlevel9k"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Record and share terminal sessions
brew "asciinema"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Development kit for the Java programming language
brew "openjdk"
# Light-weight XML database and XPath/XQuery processor
brew "basex"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Friendly powerful distributed version control system
brew "bazaar"
# Google's own build tool
brew "bazel"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# AST-based pattern checker for JavaScript
brew "eslint"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Network related modules for glib
brew "glib-networking"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Package for scientific computing with Python
brew "numpy"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd", restart_service: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Compiler for the GObject type system
brew "vala"
# HTTP client/server library for GNOME
brew "libsoup"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Open source relational database management system
brew "mysql", restart_service: true
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Manage multiple Node.js versions
brew "nvm"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql", restart_service: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Manage code quality
brew "sonarqube"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tiny personal calendar
brew "when"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Inspect application bundles
cask "apparency"
# Grahics renderer
cask "aquaterm"
# Monitoring and security across systems, apps, and services
cask "datadog-agent"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Vector graphics editor
cask "inkscape"
cask "java"
cask "java8"
# Full TeX Live distribution with GUI applications
cask "mactex"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
