tap "askgitdev/askgit"
tap "bazelbuild/tap"
tap "buildpacks/tap"
tap "caskformula/caskformula"
tap "domt4/autoupdate"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "sambadevi/powerlevel9k"
# Run your GitHub Actions locally
brew "act"
# Core application library for C
brew "glib"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# CLI tool for Angular
brew "angular-cli"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Password hashing library and CLI utility
brew "argon2"
# Record and share terminal sessions
brew "asciinema"
# Query git repositories with SQL. Generate reports, perform status checks, analyze codebases. 🔍 📊
brew "askgit"
# Spell checker with better logic than ispell
brew "aspell"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm@2.28"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Development kit for the Java programming language
brew "openjdk"
# Light-weight XML database and XPath/XQuery processor
brew "basex"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Friendly powerful distributed version control system
brew "bazaar"
# Google's own build tool
brew "bazel"
# Garbage collector for C and C++
brew "bdw-gc"
# Collection of portable C++ source libraries
brew "boost"
# C++ build system
brew "boost-build"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# AVH edition of git-flow
brew "git-flow-avh"
# Audit git repos for secrets
brew "gitleaks"
# Network related modules for glib
brew "glib-networking"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Package for scientific computing with Python
brew "numpy"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd", restart_service: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Build tool for Clojure
brew "leiningen"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# Implementation of the file(1) command
brew "libmagic"
# HTTP client/server library for GNOME
brew "libsoup"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Open source relational database management system
brew "mysql", restart_service: true
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Platform built on V8 to build network applications
brew "node@16"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@17"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Tool for creating isolated virtual python environments
brew "virtualenv", link: false
# Python dependency management tool
brew "pipenv", link: false
# Fast, disk space efficient package manager
brew "pnpm", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Software environment for statistical computing
brew "r"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Manage code quality
brew "sonarqube"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Compiler for the GObject type system
brew "vala"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tiny personal calendar
brew "when"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# GPU-accelerated terminal emulator
cask "alacritty"
# Inspect application bundles
cask "apparency"
# Graphics renderer
cask "aquaterm"
# Monitoring and security across systems, apps, and services
cask "datadog-agent"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Vector graphics editor
cask "inkscape"
cask "java8"
# Full TeX Live distribution with GUI applications
cask "mactex"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdBlock", id: 1402042596
mas "AdGuard for Safari", id: 1440147259
mas "CopyClip", id: 595191960
mas "Dropover", id: 1355679052
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Duplicate File Finder", id: 1032755628
mas "Easy CSV Editor", id: 1171346381
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "Grammarly for Safari", id: 1462114288
mas "Image2icon", id: 992115977
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Medis", id: 1579200037
mas "Microsoft Outlook", id: 985367838
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 1284863847
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
