tap "askgitdev/askgit"
tap "aurc/loggo"
tap "bazelbuild/tap"
tap "bufbuild/buf"
tap "buildpacks/tap"
tap "caskformula/caskformula"
tap "derailed/k9s"
tap "domt4/autoupdate"
tap "hashicorp/tap"
tap "heroku/brew"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "sambadevi/powerlevel9k"
tap "tw93/tap"
# Run your GitHub Actions locally
brew "act"
# Core application library for C
brew "glib"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Angular
brew "angular-cli"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Password hashing library and CLI utility
brew "argon2"
# Record and share terminal sessions
brew "asciinema"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Code searching, linting, rewriting
brew "ast-grep"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm"
# Official C++ interface for the ATK accessibility toolkit library
brew "atkmm@2.28"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Development kit for the Java programming language
brew "openjdk"
# Light-weight XML database and XPath/XQuery processor
brew "basex"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Google's own build tool
brew "bazel"
# Garbage collector for C and C++
brew "bdw-gc"
# Toolchain of the web
brew "biome"
# Collection of portable C++ source libraries
brew "boost"
# C++ build system
brew "boost-build"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# C++ library for C++/Python3 interoperability
brew "boost-python3"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Lightning-fast linter for .env files written in Rust
brew "dotenv-linter"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Audit git repos for secrets
brew "gitleaks"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go Language's command-line interface for database migrations
brew "goose"
# Foreman clone written in Go
brew "goreman"
# Library access to GnuPG
brew "gpgme"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana", restart_service: :changed
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Package for scientific computing with Python
brew "numpy"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Software for mathematics, science, and engineering
brew "scipy"
# Efficient network analysis for Python 3
brew "graph-tool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Like cURL, but for gRPC
brew "grpcurl"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd", restart_service: :changed
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Statically typed programming language for the JVM
brew "kotlin"
# Package manager for kubectl plugins
brew "krew"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Build tool for Clojure
brew "leiningen"
# Tool for managing JavaScript projects with multiple packages
brew "lerna"
# Implementation of the file(1) command
brew "libmagic"
# Postgres C API library
brew "libpq"
# HTTP client/server library for GNOME
brew "libsoup"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Fly through your shell history
brew "mcfly"
# Provides a formatted and highlighted view of Markdown files in Terminal
brew "mdless"
# Scalable distributed version control system
brew "mercurial"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Shell command parallelization utility
brew "parallel"
# Apache Parquet command-line tools and utilities
brew "parquet-cli"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Python dependency management tool
brew "pipenv"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Modern replacement for ps written in Rust
brew "procs"
# Monitor data's progress through a pipe
brew "pv"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Ultra-fast CSV data-wrangling toolkit
brew "qsv"
# Cross-platform application and UI framework
brew "qt"
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Fast, configurable, extensible, flexible, and beautiful linter for Go
brew "revive"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Generate type safe Go from SQL
brew "sqlc"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Log file highlighter
brew "tailspin"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Compiler for the GObject type system
brew "vala"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tiny personal calendar
brew "when"
# CSV CLI magician written in Rust
brew "xan"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Rich Terminal User Interface for streaming structured logs
brew "aurc/loggo/loggo"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Terraform
brew "hashicorp/tap/terraform"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
# Command-line interface for 1Password
cask "1password-cli"
# Inspect application bundles
cask "apparency"
# Terminal-based AI coding assistant
cask "claude-code"
# Monitoring and security across systems, apps, and services
cask "datadog-agent"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Vector graphics editor
cask "inkscape"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Modern GUI for Redis
cask "medis"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Redis GUI built with Rust and GPUI
cask "zedis"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdBlock", id: 1402042596
mas "AdGuard for Safari", id: 1440147259
mas "Dropover", id: 1355679052
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Duplicate File Finder", id: 1032755628
mas "Easy CSV Editor", id: 1171346381
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "Grammarly for Safari", id: 1462114288
mas "Image2Icon", id: 992115977
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "Xcode", id: 497799835
go "github.com/GoogleCloudPlatform/cloud-sql-proxy/v2"
go "github.com/cloudevents/conformance/cmd/cloudevents"
go "github.com/bobg/decouple/cmd/decouple"
go "github.com/googleapis/gnostic-grpc"
go "github.com/actgardner/gogen-avro/v10/cmd/gogen-avro"
go "github.com/vasi-stripe/gogroup/cmd/gogroup"
go "github.com/pidanou/helm-tui"
go "github.com/golang/mock/mockgen"
go "github.com/deepmap/oapi-codegen/cmd/oapi-codegen"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/bufbuild/protoschema-plugins/cmd/protoc-gen-pubsub"
cargo "alacritty"
cargo "cargo-expand"
cargo "cargo-sort"
cargo "cargo-udeps"
cargo "flamegraph"
cargo "pqrs"
cargo "starship"
